{"modelTopology": {"keras_version": "2.1.6-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}}, "weightsManifest": [{"paths": ["group1-shard1of99", "group1-shard2of99", "group1-shard3of99", "group1-shard4of99", "group1-shard5of99", "group1-shard6of99", "group1-shard7of99", "group1-shard8of99", "group1-shard9of99", "group1-shard10of99", "group1-shard11of99", "group1-shard12of99", "group1-shard13of99", "group1-shard14of99", "group1-shard15of99", "group1-shard16of99", "group1-shard17of99", "group1-shard18of99", "group1-shard19of99", "group1-shard20of99", "group1-shard21of99", "group1-shard22of99", "group1-shard23of99", "group1-shard24of99", "group1-shard25of99", "group1-shard26of99", "group1-shard27of99", "group1-shard28of99", "group1-shard29of99", "group1-shard30of99", "group1-shard31of99", "group1-shard32of99", "group1-shard33of99", "group1-shard34of99", "group1-shard35of99", "group1-shard36of99", "group1-shard37of99", "group1-shard38of99", "group1-shard39of99", "group1-shard40of99", "group1-shard41of99", "group1-shard42of99", "group1-shard43of99", "group1-shard44of99", "group1-shard45of99", "group1-shard46of99", "group1-shard47of99", "group1-shard48of99", "group1-shard49of99", "group1-shard50of99", "group1-shard51of99", "group1-shard52of99", "group1-shard53of99", "group1-shard54of99", "group1-shard55of99", "group1-shard56of99", "group1-shard57of99", "group1-shard58of99", "group1-shard59of99", "group1-shard60of99", "group1-shard61of99", "group1-shard62of99", "group1-shard63of99", "group1-shard64of99", "group1-shard65of99", "group1-shard66of99", "group1-shard67of99", "group1-shard68of99", "group1-shard69of99", "group1-shard70of99", "group1-shard71of99", "group1-shard72of99", "group1-shard73of99", "group1-shard74of99", "group1-shard75of99", "group1-shard76of99", "group1-shard77of99", "group1-shard78of99", "group1-shard79of99", "group1-shard80of99", "group1-shard81of99", "group1-shard82of99", "group1-shard83of99", "group1-shard84of99", "group1-shard85of99", "group1-shard86of99", "group1-shard87of99", "group1-shard88of99", "group1-shard89of99", "group1-shard90of99", "group1-shard91of99", "group1-shard92of99", "group1-shard93of99", "group1-shard94of99", "group1-shard95of99", "group1-shard96of99", "group1-shard97of99", "group1-shard98of99", "group1-shard99of99"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense/kernel", "shape": [100352, 1024], "dtype": "float32"}, {"name": "dense/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [512, 4], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4], "dtype": "float32"}]}]}